### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # dx_available_subnet_cidr.next_cidr_cae will be created
  + resource "dx_available_subnet_cidr" "next_cidr_cae" {
      + cidr_block         = (known after apply)
      + id                 = (known after apply)
      + prefix_length      = 23
      + virtual_network_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01"
    }

  # module.function_app.azurerm_monitor_autoscale_setting.app_be_fn will be destroyed
  # (because azurerm_monitor_autoscale_setting.app_be_fn is not in configuration)
  - resource "azurerm_monitor_autoscale_setting" "app_be_fn" {
      - enabled             = true -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Insights/autoScaleSettings/io-p-itn-svc-app-be-func-01-autoscale" -> null
      - location            = "italynorth" -> null
      - name                = "io-p-itn-svc-app-be-func-01-autoscale" -> null
      - resource_group_name = "io-p-itn-svc-rg-01" -> null
      - tags                = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Prod"
          - "ManagementTeam" = "IO Enti & Servizi"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        } -> null
      - target_resource_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-app-be-asp-01" -> null

      - profile {
          - name = jsonencode(
                {
                  - for  = "evening"
                  - name = "default"
                }
            ) -> null

          - capacity {
              - default = 4 -> null
              - maximum = 30 -> null
              - minimum = 3 -> null
            }

          - recurrence {
              - days     = [
                  - "Monday",
                  - "Tuesday",
                  - "Wednesday",
                  - "Thursday",
                  - "Friday",
                  - "Saturday",
                  - "Sunday",
                ] -> null
              - hours    = [
                  - 22,
                ] -> null
              - minutes  = [
                  - 59,
                ] -> null
              - timezone = "W. Europe Standard Time" -> null
            }

          - rule {
              - metric_trigger {
                  - divide_by_instance_count = false -> null
                  - metric_name              = "Requests" -> null
                  - metric_namespace         = "microsoft.web/sites" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-app-be-func-01" -> null
                  - operator                 = "GreaterThan" -> null
                  - statistic                = "Average" -> null
                  - threshold                = 3000 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT1M" -> null
                }
              - scale_action {
                  - cooldown  = "PT1M" -> null
                  - direction = "Increase" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 2 -> null
                }
            }
          - rule {
              - metric_trigger {
                  - divide_by_instance_count = false -> null
                  - metric_name              = "CpuPercentage" -> null
                  - metric_namespace         = "microsoft.web/serverfarms" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-app-be-asp-01" -> null
                  - operator                 = "GreaterThan" -> null
                  - statistic                = "Average" -> null
                  - threshold                = 60 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT5M" -> null
                }
              - scale_action {
                  - cooldown  = "PT5M" -> null
                  - direction = "Increase" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 2 -> null
                }
            }
          - rule {
              - metric_trigger {
                  - divide_by_instance_count = false -> null
                  - metric_name              = "MemoryPercentage" -> null
                  - metric_namespace         = "microsoft.web/serverfarms" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-app-be-asp-01" -> null
                  - operator                 = "GreaterThan" -> null
                  - statistic                = "Average" -> null
                  - threshold                = 85 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT5M" -> null
                }
              - scale_action {
                  - cooldown  = "PT5M" -> null
                  - direction = "Increase" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 1 -> null
                }
            }
          - rule {
              - metric_trigger {
                  - divide_by_instance_count = false -> null
                  - metric_name              = "Requests" -> null
                  - metric_namespace         = "microsoft.web/sites" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-app-be-func-01" -> null
                  - operator                 = "LessThan" -> null
                  - statistic                = "Average" -> null
                  - threshold                = 2000 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT7M" -> null
                }
              - scale_action {
                  - cooldown  = "PT5M" -> null
                  - direction = "Decrease" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 1 -> null
                }
            }
          - rule {
              - metric_trigger {
                  - divide_by_instance_count = false -> null
                  - metric_name              = "CpuPercentage" -> null
                  - metric_namespace         = "microsoft.web/serverfarms" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-app-be-asp-01" -> null
                  - operator                 = "LessThan" -> null
                  - statistic                = "Average" -> null
                  - threshold                = 30 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT7M" -> null
                }
              - scale_action {
                  - cooldown  = "PT5M" -> null
                  - direction = "Decrease" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 1 -> null
                }
            }
        }
      - profile {
          - name = jsonencode(
                {
                  - for  = "night"
                  - name = "default"
                }
            ) -> null

          - capacity {
              - default = 4 -> null
              - maximum = 30 -> null
              - minimum = 3 -> null
            }

          - recurrence {
              - days     = [
                  - "Monday",
                  - "Tuesday",
                  - "Wednesday",
                  - "Thursday",
                  - "Friday",
                  - "Saturday",
                  - "Sunday",
                ] -> null
              - hours    = [
                  - 5,
                ] -> null
              - minutes  = [
                  - 0,
                ] -> null
              - timezone = "W. Europe Standard Time" -> null
            }

          - rule {
              - metric_trigger {
                  - divide_by_instance_count = false -> null
                  - metric_name              = "Requests" -> null
                  - metric_namespace         = "microsoft.web/sites" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-app-be-func-01" -> null
                  - operator                 = "GreaterThan" -> null
                  - statistic                = "Average" -> null
                  - threshold                = 3000 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT1M" -> null
                }
              - scale_action {
                  - cooldown  = "PT1M" -> null
                  - direction = "Increase" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 2 -> null
                }
            }
          - rule {
              - metric_trigger {
                  - divide_by_instance_count = false -> null
                  - metric_name              = "CpuPercentage" -> null
                  - metric_namespace         = "microsoft.web/serverfarms" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-app-be-asp-01" -> null
                  - operator                 = "GreaterThan" -> null
                  - statistic                = "Average" -> null
                  - threshold                = 60 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT5M" -> null
                }
              - scale_action {
                  - cooldown  = "PT5M" -> null
                  - direction = "Increase" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 2 -> null
                }
            }
          - rule {
              - metric_trigger {
                  - divide_by_instance_count = false -> null
                  - metric_name              = "MemoryPercentage" -> null
                  - metric_namespace         = "microsoft.web/serverfarms" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-app-be-asp-01" -> null
                  - operator                 = "GreaterThan" -> null
                  - statistic                = "Average" -> null
                  - threshold                = 85 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT5M" -> null
                }
              - scale_action {
                  - cooldown  = "PT5M" -> null
                  - direction = "Increase" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 1 -> null
                }
            }
          - rule {
              - metric_trigger {
                  - divide_by_instance_count = false -> null
                  - metric_name              = "Requests" -> null
                  - metric_namespace         = "microsoft.web/sites" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-app-be-func-01" -> null
                  - operator                 = "LessThan" -> null
                  - statistic                = "Average" -> null
                  - threshold                = 2000 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT7M" -> null
                }
              - scale_action {
                  - cooldown  = "PT5M" -> null
                  - direction = "Decrease" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 1 -> null
                }
            }
          - rule {
              - metric_trigger {
                  - divide_by_instance_count = false -> null
                  - metric_name              = "CpuPercentage" -> null
                  - metric_namespace         = "microsoft.web/serverfarms" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-app-be-asp-01" -> null
                  - operator                 = "LessThan" -> null
                  - statistic                = "Average" -> null
                  - threshold                = 30 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT7M" -> null
                }
              - scale_action {
                  - cooldown  = "PT5M" -> null
                  - direction = "Decrease" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 1 -> null
                }
            }
        }
      - profile {
          - name = "evening" -> null

          - capacity {
              - default = 5 -> null
              - maximum = 30 -> null
              - minimum = 3 -> null
            }

          - recurrence {
              - days     = [
                  - "Monday",
                  - "Tuesday",
                  - "Wednesday",
                  - "Thursday",
                  - "Friday",
                  - "Saturday",
                  - "Sunday",
                ] -> null
              - hours    = [
                  - 19,
                ] -> null
              - minutes  = [
                  - 30,
                ] -> null
              - timezone = "W. Europe Standard Time" -> null
            }

          - rule {
              - metric_trigger {
                  - divide_by_instance_count = false -> null
                  - metric_name              = "Requests" -> null
                  - metric_namespace         = "microsoft.web/sites" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-app-be-func-01" -> null
                  - operator                 = "GreaterThan" -> null
                  - statistic                = "Average" -> null
                  - threshold                = 3000 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT1M" -> null
                }
              - scale_action {
                  - cooldown  = "PT1M" -> null
                  - direction = "Increase" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 2 -> null
                }
            }
          - rule {
              - metric_trigger {
                  - divide_by_instance_count = false -> null
                  - metric_name              = "CpuPercentage" -> null
                  - metric_namespace         = "microsoft.web/serverfarms" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-app-be-asp-01" -> null
                  - operator                 = "GreaterThan" -> null
                  - statistic                = "Average" -> null
                  - threshold                = 60 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT5M" -> null
                }
              - scale_action {
                  - cooldown  = "PT5M" -> null
                  - direction = "Increase" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 2 -> null
                }
            }
          - rule {
              - metric_trigger {
                  - divide_by_instance_count = false -> null
                  - metric_name              = "MemoryPercentage" -> null
                  - metric_namespace         = "microsoft.web/serverfarms" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-app-be-asp-01" -> null
                  - operator                 = "GreaterThan" -> null
                  - statistic                = "Average" -> null
                  - threshold                = 85 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT5M" -> null
                }
              - scale_action {
                  - cooldown  = "PT5M" -> null
                  - direction = "Increase" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 1 -> null
                }
            }
          - rule {
              - metric_trigger {
                  - divide_by_instance_count = false -> null
                  - metric_name              = "Requests" -> null
                  - metric_namespace         = "microsoft.web/sites" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-app-be-func-01" -> null
                  - operator                 = "LessThan" -> null
                  - statistic                = "Average" -> null
                  - threshold                = 2000 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT7M" -> null
                }
              - scale_action {
                  - cooldown  = "PT5M" -> null
                  - direction = "Decrease" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 1 -> null
                }
            }
          - rule {
              - metric_trigger {
                  - divide_by_instance_count = false -> null
                  - metric_name              = "CpuPercentage" -> null
                  - metric_namespace         = "microsoft.web/serverfarms" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-app-be-asp-01" -> null
                  - operator                 = "LessThan" -> null
                  - statistic                = "Average" -> null
                  - threshold                = 30 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT7M" -> null
                }
              - scale_action {
                  - cooldown  = "PT5M" -> null
                  - direction = "Decrease" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 1 -> null
                }
            }
        }
      - profile {
          - name = "night" -> null

          - capacity {
              - default = 3 -> null
              - maximum = 30 -> null
              - minimum = 3 -> null
            }

          - recurrence {
              - days     = [
                  - "Monday",
                  - "Tuesday",
                  - "Wednesday",
                  - "Thursday",
                  - "Friday",
                  - "Saturday",
                  - "Sunday",
                ] -> null
              - hours    = [
                  - 23,
                ] -> null
              - minutes  = [
                  - 0,
                ] -> null
              - timezone = "W. Europe Standard Time" -> null
            }

          - rule {
              - metric_trigger {
                  - divide_by_instance_count = false -> null
                  - metric_name              = "Requests" -> null
                  - metric_namespace         = "microsoft.web/sites" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-app-be-func-01" -> null
                  - operator                 = "GreaterThan" -> null
                  - statistic                = "Average" -> null
                  - threshold                = 3000 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT1M" -> null
                }
              - scale_action {
                  - cooldown  = "PT1M" -> null
                  - direction = "Increase" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 2 -> null
                }
            }
          - rule {
              - metric_trigger {
                  - divide_by_instance_count = false -> null
                  - metric_name              = "CpuPercentage" -> null
                  - metric_namespace         = "microsoft.web/serverfarms" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-app-be-asp-01" -> null
                  - operator                 = "GreaterThan" -> null
                  - statistic                = "Average" -> null
                  - threshold                = 60 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT5M" -> null
                }
              - scale_action {
                  - cooldown  = "PT5M" -> null
                  - direction = "Increase" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 2 -> null
                }
            }
          - rule {
              - metric_trigger {
                  - divide_by_instance_count = false -> null
                  - metric_name              = "MemoryPercentage" -> null
                  - metric_namespace         = "microsoft.web/serverfarms" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-app-be-asp-01" -> null
                  - operator                 = "GreaterThan" -> null
                  - statistic                = "Average" -> null
                  - threshold                = 85 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT5M" -> null
                }
              - scale_action {
                  - cooldown  = "PT5M" -> null
                  - direction = "Increase" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 1 -> null
                }
            }
          - rule {
              - metric_trigger {
                  - divide_by_instance_count = false -> null
                  - metric_name              = "Requests" -> null
                  - metric_namespace         = "microsoft.web/sites" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-app-be-func-01" -> null
                  - operator                 = "LessThan" -> null
                  - statistic                = "Average" -> null
                  - threshold                = 2000 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT7M" -> null
                }
              - scale_action {
                  - cooldown  = "PT5M" -> null
                  - direction = "Decrease" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 1 -> null
                }
            }
          - rule {
              - metric_trigger {
                  - divide_by_instance_count = false -> null
                  - metric_name              = "CpuPercentage" -> null
                  - metric_namespace         = "microsoft.web/serverfarms" -> null
                  - metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-app-be-asp-01" -> null
                  - operator                 = "LessThan" -> null
                  - statistic                = "Average" -> null
                  - threshold                = 30 -> null
                  - time_aggregation         = "Average" -> null
                  - time_grain               = "PT1M" -> null
                  - time_window              = "PT7M" -> null
                }
              - scale_action {
                  - cooldown  = "PT5M" -> null
                  - direction = "Decrease" -> null
                  - type      = "ChangeCount" -> null
                  - value     = 1 -> null
                }
            }
        }
    }

  # module.container_apps.module.svc_container_app_environment_itn.azurerm_container_app_environment.this will be created
  + resource "azurerm_container_app_environment" "this" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + infrastructure_subnet_id         = (known after apply)
      + internal_load_balancer_enabled   = true
      + location                         = "italynorth"
      + log_analytics_workspace_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.OperationalInsights/workspaces/io-p-law-common"
      + logs_destination                 = (known after apply)
      + mutual_tls_enabled               = false
      + name                             = "io-p-itn-svc-cae-01"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "io-p-itn-svc-rg-01"
      + static_ip_address                = (known after apply)
      + tags                             = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "ModuleName"     = "azure_container_app_environment"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.2"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
      + zone_redundancy_enabled          = true

      + timeouts {
          + create = "60m"
        }

      + workload_profile {
          + maximum_count         = 1
          + minimum_count         = 1
          + name                  = "Consumption"
          + workload_profile_type = "Consumption"
        }
    }

  # module.container_apps.module.svc_container_app_environment_itn.azurerm_management_lock.cae_lock will be created
  + resource "azurerm_management_lock" "cae_lock" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "io-p-itn-svc-cae-01"
      + notes      = "Lock for the Container App Environment"
      + scope      = (known after apply)
    }

  # module.container_apps.module.svc_container_app_environment_itn.azurerm_management_lock.identity_lock will be created
  + resource "azurerm_management_lock" "identity_lock" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "io-p-itn-svc-cae-id-01"
      + notes      = "Lock for the user-assigned managed identity"
      + scope      = (known after apply)
    }

  # module.container_apps.module.svc_container_app_environment_itn.azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-svc-cae-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "ModuleName"     = "azure_container_app_environment"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.2"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.italynorth.azurecontainerapps.io",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-svc-cae-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "managedEnvironments",
            ]
        }
    }

  # module.container_apps.module.svc_container_app_environment_itn.azurerm_subnet.this[0] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                              = (known after apply)
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "io-p-itn-svc-cae-snet-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "io-p-itn-common-rg-01"
      + virtual_network_name                          = "io-p-itn-common-vnet-01"

      + delegation {
          + name = "Microsoft.App/environments"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.App/environments"
            }
        }
    }

  # module.container_apps.module.svc_container_app_environment_itn.azurerm_user_assigned_identity.cae_identity will be created
  + resource "azurerm_user_assigned_identity" "cae_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-svc-cae-id-01"
      + principal_id        = (known after apply)
      + resource_group_name = "io-p-itn-svc-rg-01"
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "ModuleName"     = "azure_container_app_environment"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.2"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
      + tenant_id           = (known after apply)
    }

  # module.function_app.module.app_be_fn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          ~ "FUNCTIONS_WORKER_PROCESS_COUNT"                                                                   = "4" -> "2"
            # (22 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-app-be-func-01"
        name                                           = "io-p-itn-svc-app-be-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Enti & Servizi"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "0.3.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ sticky_settings {
          ~ app_setting_names       = [
              - "APPINSIGHTS_SAMPLING_PERCENTAGE",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
                "SLOT_TASK_HUBNAME",
                "AzureFunctionsJobHost__extensions__durableTask__hubName",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
                "AzureFunctionsWebHost__hostid",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.function_app.module.app_be_fn.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          ~ "FUNCTIONS_WORKER_PROCESS_COUNT"                                                                   = "4" -> "2"
            # (23 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-app-be-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Enti & Servizi"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "0.3.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_app.module.app_be_fn.azurerm_service_plan.this[0] will be updated in-place
  ~ resource "azurerm_service_plan" "this" {
        id                              = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-app-be-asp-01"
        name                            = "io-p-itn-svc-app-be-asp-01"
      ~ sku_name                        = "P1mv3" -> "P1v3"
        tags                            = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (11 unchanged attributes hidden)
    }

  # module.function_app.module.function_profile_autoscale.azurerm_monitor_autoscale_setting.this will be created
  + resource "azurerm_monitor_autoscale_setting" "this" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-svc-as-be-as-01"
      + resource_group_name = "io-p-itn-svc-rg-01"
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "ModuleName"     = "azure_app_service_plan_autoscaler"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.0"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
      + target_resource_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-app-be-asp-01"

      + profile {
          + name = "high_load_profile"

          + capacity {
              + default = 12
              + maximum = 30
              + minimum = 3
            }

          + recurrence {
              + days     = [
                  + "Monday",
                  + "Tuesday",
                  + "Wednesday",
                  + "Thursday",
                  + "Friday",
                  + "Saturday",
                  + "Sunday",
                ]
              + hours    = [
                  + 19,
                ]
              + minutes  = [
                  + 30,
                ]
              + timezone = "W. Europe Standard Time"
            }

          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "CpuPercentage"
                  + metric_namespace         = "microsoft.web/serverfarms"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-app-be-asp-01"
                  + operator                 = "GreaterThan"
                  + statistic                = "Max"
                  + threshold                = 40
                  + time_aggregation         = "Maximum"
                  + time_grain               = "PT1M"
                  + time_window              = "PT1M"
                }
              + scale_action {
                  + cooldown  = "PT3M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 2
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "CpuPercentage"
                  + metric_namespace         = "microsoft.web/serverfarms"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-app-be-asp-01"
                  + operator                 = "LessThan"
                  + statistic                = "Average"
                  + threshold                = 15
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "MemoryPercentage"
                  + metric_namespace         = "microsoft.web/serverfarms"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-app-be-asp-01"
                  + operator                 = "GreaterThan"
                  + statistic                = "Average"
                  + threshold                = 85
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT1M"
                }
              + scale_action {
                  + cooldown  = "PT3M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "MemoryPercentage"
                  + metric_namespace         = "microsoft.web/serverfarms"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-app-be-asp-01"
                  + operator                 = "LessThan"
                  + statistic                = "Average"
                  + threshold                = 20
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
        }
      + profile {
          + name = jsonencode(
                {
                  + for  = "high_load_profile"
                  + name = "default"
                }
            )

          + capacity {
              + default = 11
              + maximum = 30
              + minimum = 3
            }

          + recurrence {
              + days     = [
                  + "Monday",
                  + "Tuesday",
                  + "Wednesday",
                  + "Thursday",
                  + "Friday",
                  + "Saturday",
                  + "Sunday",
                ]
              + hours    = [
                  + 22,
                ]
              + minutes  = [
                  + 59,
                ]
              + timezone = "W. Europe Standard Time"
            }

          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "CpuPercentage"
                  + metric_namespace         = "microsoft.web/serverfarms"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-app-be-asp-01"
                  + operator                 = "GreaterThan"
                  + statistic                = "Max"
                  + threshold                = 40
                  + time_aggregation         = "Maximum"
                  + time_grain               = "PT1M"
                  + time_window              = "PT1M"
                }
              + scale_action {
                  + cooldown  = "PT3M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 2
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "CpuPercentage"
                  + metric_namespace         = "microsoft.web/serverfarms"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-app-be-asp-01"
                  + operator                 = "LessThan"
                  + statistic                = "Average"
                  + threshold                = 15
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "MemoryPercentage"
                  + metric_namespace         = "microsoft.web/serverfarms"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-app-be-asp-01"
                  + operator                 = "GreaterThan"
                  + statistic                = "Average"
                  + threshold                = 85
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT1M"
                }
              + scale_action {
                  + cooldown  = "PT3M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "MemoryPercentage"
                  + metric_namespace         = "microsoft.web/serverfarms"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-svc-app-be-asp-01"
                  + operator                 = "LessThan"
                  + statistic                = "Average"
                  + threshold                = 20
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
        }
    }

Plan: 8 to add, 3 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.cms_function_app.azurerm_monitor_diagnostic_setting.queue_diagnostic_setting,
  on ../_modules/cms_function_app/monitoring.tf line 138, in resource "azurerm_monitor_diagnostic_setting" "queue_diagnostic_setting":
 138: resource "azurerm_monitor_diagnostic_setting" "queue_diagnostic_setting" {

`metric` has been deprecated in favor of the `enabled_metric` property and
will be removed in v5.0 of the AzureRM provider

(and 31 more similar warnings elsewhere)

Warning: Deprecated attribute

  on ../_modules/function_app/storage_account.tf line 9, in resource "azurerm_storage_blob" "featured_services":
   9:   storage_account_name   = azurerm_storage_container.static_content.storage_account_name

The attribute "storage_account_name" is deprecated. Refer to the provider
documentation for details.

(and 7 more similar warnings elsewhere)
```

</details>
